<script setup lang="ts">

</script>

<template>
  <div class="max-w-4xl mx-auto">
    <div class="space-y-8">
      <h1 class="text-4xl text-center font-bold">真理</h1>
      <p>
        这个网站使用到的理论来源是
        <a class="underline" href="https://www.bilibili.com/video/BV1FJ4m137pi/" target="_blank">SearchLight探照灯的救赎的边缘老四内场底层机制详解</a>，
        根据我自己的理解就是：内场，A把图形S给B，那么B房间雕像手上的S图形会消失，并且B房间的图形会增加一个S，相对的A房间的S会消失。
        内场出去的前提是任意内场玩家A场地里的B和C雕像手上的图形消失，同时A将两个2D图形拼成3D图形，且这个3D图形和外场拼成的A雕像手上的3D图形相同，即可。
      </p>
      <p>
        依照这个说法，可以派生出很多种打法，我比较倾向于一种需要步数较多，但是比较无脑的打法。
        这个打法的内场分为两个步骤：第一步，把对应的图案传给对应的房间，例如雕像A/B/C手上的是034
        （0是圆，3是三角形，4是正方形，都是指代的2D图形，后面相同；从左到右），
        房间A/B/C内是03/34/04，那么A房间需要把0留着，把3给B房间，同理B房间需要把3留着，4给C房间，如此，第一轮可以达到雕像手上的图案和
        房间里的两个图案相同，即A房间雕像是0，房间内是00。
        第二轮，我们需要把房间内的图形给分别给另外两个房间，例如A房间的00分别传给B和C，如此每个房间必定会收到来自其他房间的不同的两个图形，例如
        A房间雕像是0，必定会收到来自其他房间的3和4，其他房间同理。这样必定可以消除雕像上的阴影。
      </p>
    </div>
  </div>
</template>

<style scoped lang="postcss">

</style>